#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаПериодДействия.Видимость = Ложь;
	Элементы.ГруппаСуммовыеРеквизиты.Видимость = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание")Тогда
			
		Элементы.ГруппаПериодДействия.Видимость = Истина;
		Элементы.ГруппаСуммовыеРеквизиты.Видимость = Истина;
		
	Иначе
		
		Элементы.ГруппаПериодДействия.Видимость = Ложь;
		Элементы.ГруппаСуммовыеРеквизиты.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание")Тогда
	
		Если ЗначениеЗаполнено(Объект.ВКМ_ПериодДействияНачало) Тогда
			Объект.ВКМ_ПериодДействияНачало = ""; 		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ВКМ_ПериодДействияКонец) Тогда
			Объект.ВКМ_ПериодДействияКонец = ""; 		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ВКМ_СуммаАбонентскойПлаты) Тогда
			Объект.ВКМ_СуммаАбонентскойПлаты = 0; 		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ВКМ_СтоимостьЧасаРаботы) Тогда
			Объект.ВКМ_СтоимостьЧасаРаботы = 0; 		
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание")Тогда
			
		Элементы.ГруппаПериодДействия.Видимость = Истина;
		Элементы.ГруппаСуммовыеРеквизиты.Видимость = Истина;
		
	Иначе
		
		Элементы.ГруппаПериодДействия.Видимость = Ложь;
		Элементы.ГруппаСуммовыеРеквизиты.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

